app/views/employees/index.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."id" IN (SELECT "employees"."id" FROM "employees" WHERE (name ilike '%sd%'))
---
<%= form.label :list_employees, "List" %>
<%= form.select :list_employees, options_for_select(@employees.map { |employee| [employee.name]  }) %>