app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "gender", "dob", "address", "created_at", "updated_at", "department", "doj", "emp_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
  	puts "Data:#{params}"
  	@employee = Employee.new(employee_params)

  	if @employee.save

UPDATE "employees" SET "gender" = $1, "updated_at" = $2, "department" = $3, "doj" = $4 WHERE "employees"."id" = $5  [["gender", "male"], ["updated_at", "2021-03-01 06:19:38.236036"], ["department", "Technical"], ["doj", "2010-08-11"], ["id", 2]]
---
  def update
    @employee = Employee.find(params[:id])

    if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy