app/controllers/employees_controller.rb

  def index

    order = params[:order]
    order = "ASC" unless order
    page = 10
    puts "First employee id is : #{Employee.first.id.class}"
    if params[:order]
  	  @employees = Employee.search(params[:search]).paginate(page: params[:page], per_page:page).order("name #{order}")
---
SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "employees"

  def create
  	@employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "gender", "dob", "address", "created_at", "updated_at", "department", "doj", "emp_id", "image", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def edit
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN ($1, $2)  [[nil, 11], [nil, 6]]

  def update
    @employee = Employee.find(params[:id])

    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
UPDATE "employees" SET "gender" = $1, "updated_at" = $2, "department" = $3, "doj" = $4 WHERE "employees"."id" = $5  [["gender", "male"], ["updated_at", "2021-03-01 06:19:38.236036"], ["department", "Technical"], ["doj", "2010-08-11"], ["id", 2]]

  def delete_selected

    puts params

    Employee.where(:id => params[:employee_ids]).destroy_all
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 11]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN ($1, $2)  [[nil, 11], [nil, 6]]