app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    @equipment = Equipment.all

INSERT INTO "equipment" ("device_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["device_id", "BS_101"], ["name", "Dell Latitude 5340"], ["created_at", "2021-02-24 05:40:03.661586"], ["updated_at", "2021-02-24 05:40:03.661586"]]
---
  def create
    @equipment = Equipment.new(equipment_params)

    respond_to do |format|
      if @equipment.save

SELECT "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_equipment
      @equipment = Equipment.find(params[:id])