app/models/employee.rb

SELECT "employees".* FROM "employees" WHERE (name ilike '%a%')
---
  def self.search(search)
    if search
      Employee.where("name ilike ?", "%#{search}%")

SELECT "employees".* FROM "employees" WHERE "employees"."emp_id" = $1 LIMIT $2  [["emp_id", "BS119"], ["LIMIT", 1]]
INSERT INTO "employees" ("name", "gender", "dob", "address", "created_at", "updated_at", "department", "doj", "emp_id", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def self.import(file)
    spreadsheet = open_spreadsheet(file)
    header = spreadsheet.row(1)
    (2..spreadsheet.last_row).each do |i|
      row = Hash[[header,spreadsheet.row(i)].transpose]

    #using direct csv
    #CSV.foreach(file.path, headers: true) do |row|

      emp = Employee.find_by(emp_id:row["emp_id"])
      #code to understand
        # employee = find_by_id(row["id"]) || new
        # employee.attributes = row.to_hash.slice(*attr_accessor)
        # employee.save!

      if !emp
        #puts "Empid: #{emp.emp_id}"
        Employee.create! row.to_hash